interface Book {
    bookId: string;
    title: string;
    author: string;
    language: string;
    text: string;
}

export const books: Book[] = [
    {
        bookId: "1",
        title: "איילת מטיילת",
        author: "רינת הופר", 
        language: "hebrew",
        text: `
שמש זורחת
בין ענני התכלת,
ובשביל מטיילת...

הילדה אילת.

צועדת לה אילת
שמחה וצוהלת.

פתאום היא פוגשת
חיה קטנה בדשא.
מי שם פוסעת חרישית?

חיפושית!

אומרת החיפושית העצלה:
אני ממהרת אל בית הנמלה

קחי אותי איתך
בכיס השמלה.

הולכת אילת
שמחה וצוהלת
עם חיפושית עגלה
בכיס השמלה.

כמה נפלא!

פתאום בראש העץ
קול קטן מציץ

מי שם פוצה מקור?



ציפור!

אומרת הציפור מעץ הברוש:
''גם אני רוצה לנפש.

אולי אשב לך על הראש?''

הולכת אילת
שמחה ומתלתלת
עם ציפור בת-ברוש

על הראש
וחיפושית עגלה
בכיס השמלה

כמה נפלא!

פתאום בין פרחי הגינה
זזה לאט קונכיה לבנה.
מי שם זוחל בלי חיפזון?


חלזון!

אומר החילזון:
''אני חולה ומנזל.
אתקדם מהר יותר

אם אשב על הסנדל''.

הולכת אילת,
קצת מבולבלת
אם חילזון מנזל על

הסנדל,
ציפור בת-ברוש

על הראש,
וחיפושית עגולה
בכיס השמלה

כמה נפלא!

פתאום היא
רואה קצה זנב.
קול נובח הב-הב-הב!
מי זה .מי זה השובב?



כלבלב!

אומר הכלבלב

בקול נעלב:
''גם אני רוצה לבוא
ארכב לך על הגב''

הולכת אילת
בשמלה של תכלת

עם כלב שובב
על הגב,

חילזון מנוזל
על הסנדל,
ציפור בת-ברוש
על הראש,
וחיפושית עגולה
בכיס השמלה.

כמה נפלא!

פתאום בחול
שריון עגול
מנסה לאט לזחול.
מי עומד שם נעצב?



צב!

אומר הצב:
''כואב לי הגב,

אני עייף.
אפשר לנוח לך
על הכתף?''

הולכת אילת,
ולא מתעצלת,
עם צב עייף

על הכתף,
כלבלב שובב

על הגב,
חילזון מנוזל
על הסנדל,
ציפור בת-ברוש
על הראש,
וחיפושית עגולה
בכיס השמלה
כמה נפלא!

פתאום בקצה הגן
ראש מציץ מאחורי ענן.

מי מתחבא מאחורי
הדף?

ג'ירף!

אומר הג'ירף:
''אני ממש מעולף.
יש לך מקום בשבילי

על קצה האף?''



הולכת אילת,
כמעט נופלת,
עם ג'ירף מעולף

על האף,
צב עייף על הכתף,
כלבלב שובב על

הגב,

חילזון מנוזל
על הסנזל,
ציפור בת-ברוש
על הראש,
וחיפושית

עגולה
בכיס השמלה.

כמה נפלא!

הדרך ארוכה ומפותלת,
ובסופה-בית ודלת.

מי מחכה בבית פנימה?



אמא!

עומדת אמא
ומתפעלת:
מה הבאת לנו אילת?
ג'ירף ,ציפור,
כלבלב שובב,
חלזון ,חיפושית וצב.

היכנסו כלכם
לחדר האורחים,
אתן לכם עוגיות ומיץ תפוחים.`
    },
    {
        bookId: "2",
        title: "תירס חם",
        author: "מרים רות",
        language: "hebrew",
        text: `מי לא מכיר את אופיר?
אופיר אוהב לנגן ולשיר וביום קיץ חם

אוהב גם תירס חם

יום אחד יצא אופיר לטייל
ביד אחת  -קופסא ביד השנייה -מקל
איזה כיף! במקל לתופף! זה כביר! לתופף ולשיר:
בים בם בם! תירס חם! תירס חם! בים בם בם!!

שמעה את השירה לירון
באה על תלת -אופן עם פעמון נסעה לירון בעקבות אופיר

וגם היא שרה את השיר:
בים בם בם! תירס חם! תירס חם! בים בם בם!

שמעה גם יהב  ,תף ופעמון
צעדה היא -ובזרועה דובון  .יהב עם דובון לירון עם פעמון ,מתופף אופיר !!!

שלושתם שרים את השיר:
בים בם בם! תירס חם! תירס חם! בים בם בם!

שמע גם צור  ,פורץ לחצר
ובחצוצרה מחצצר

צור רץ אחרי יהב והדובון אחרי לירון והפעמון אחרי אופיר-
וכולם יחד שרים את השיר:

בים בם בם! תירס חם! תירס חם! בים בם בם!

גם אלית מופיעה עם כף וסיר
וגם היא מצטרפת לתופף ולשיר
בים בם בם! תירס חם! תירס חם! בים בם בם!

פתאום באה שחף עם עגלת בובה  -בעגלה עשרה תינוקות
איזה כיף! אופיר מתופף לירון  -מצלצלת בפעמון יהב שרה ושר הדובון

צור מחצצר-אלית מתופפת שחף שרה והצוהלת:
בים בם בם! תירס חם! תירס חם! בים בם בם!

במצעד בתזמורת ושיר הגיעו לבית של אופיר
אך מה קרה פה? מה? מה? מה? מסביב לבית שקט דממה .

אמא איננה -אבא נרדם אין תירס קר  -אין תירס חם
מפסיקים כולם לשיר וצועקים על אופיר:

איכסה פיכסה אוי ואוף! אתה אופיר אתה חצוף!!
מה זה פה ! האם שכחת ?! איפה התירס שהבטחת??
לא הבטחתי! אומר אופיר אני אוהב כך סתם לשיר...

ואם גם אין תירס בסיר
שקט עצובים כולם הרי רצינו תירס חם!

ואז ..אמרה שחף :די להצטער! נחפש תירס במקום אחר
בואו! נסתובב! יש לי רעיון! לסבא שלי יש תירס חם -המון!

צועדים כולם! בשביל לקראת ריח התבשיל:
שחף בראש עם עגלת בובות בעגלה עשרה תינוקות  .אלית מתופפת חזק ומהר

צור מחצצר ומחצצר .יהב שרה-שר הדובון לירון מצלצלת בפעמון .
ואופיר?  -מתופף ושר  .אופיר מאשר :אופיר אוהב לשיר וביום קיץ חם אוהב גם

תירס חם!!
בים בם בם! תירס חם! תירס חם! בים בם בם!

סבא בבית שמע את השיר ושם על הדשא תירס מלוא הסיר.
לכל אחד צלחת עם תירס מתוק  ,כל קלח עטוף בעלה ירוק.

ריח ניתוח מרחף באויר  -אך אין נוגעים בתירס...
ממשיכים לשיר:

תירס חם! בים בם בם! בים בם בם ! תירס חם!

עד מתי ימשיכו כך לזמר?
עד ש ...עד ש ...התירס יתקרר.
הראשון טועם אופיר ומזמין בזה השיר:
בים בם בם! תירס חם! תירס חם! מצוין!!!
אלית ושחף -צור ויהב -אופיר וגם לירון

אוכלים תירס בתאבון !!!
`
   },
   {
        bookId: "3",
        title:"האריה שאהב תות",
        author: "תרצה אתר",
        language: "hebrew",
        text: `
פעם היה אריה שאהב רק תות.
לא בשר ולא גבינה ,רק תות פשוט.
לא דיסה ולא קקאו ,רק תות הוא רצה,

תות .לא לחם ,לא ארז ולא
ביצה ,רק תות.

וביער הרחוק ההוא ,שבו הוא היה גר,
לא היה תות.

ישב האריה ובכה ,ובכה ,ואמר:
אני רוצה תות.

באה אמא שלו ,הלביאה ,ואמרה
לו ,תשמע ,חמוד - ,אין תות.
ביער שלנו אין תות.
יש פטל ,שזיפים ,סיגליות ,מרק,
יש אורז ,צ'יפס ,קבב
וארטיק ומיץ ממותק,
אבל תות אין .אין!

תפסיק לבכות ותפסיק להתאונן.

אבל האריה בכה ורצה רק תות,

ואת עיניו נגב ונגב כל הזמן בסמרטוט

ורצה רק תות.
כל הזמן בכה ,וכל הזמן רצה תות ותות.

פעם אחת הלכו ילדים קטנים לטייל ביער ההוא ,ולילדים ההם היה תות.
כי במקום שבו הם גרו ושממנו לטיול יצאו היה תות.

וכשהם יצאו לטיול ,אמא שלהם שמה להם בתיק האוכל תות,
כדי שאם פתאום יהיו רעבים ,יוכלו לאכול תות.

הרבה תות...

ראה האריה את הילדים
והריח תות.

התקרב אליהם ואמר:

תנו לי תות
!

הילדים נבהלו מאד.
הם פחדו מחיות גדולות.
והם גם לא הבינו את שפת האריות.
ולא ידעו שהוא מבקש תות.
הם חשבו שהוא רוצה לטרוף אותם אולי –
אז הם ברחו .ברחו מהר מהר ודי.

וכשהם ברחו ,נפלו להם תיקי האוכל עם התות אכל ה
והאריה הרים את התיקים והתחיל לאכול את התות.

אריה את

ועוד ו

אכל עוד תות
עוד תות

אכל ו

התות

עד שגמר הכל ואמר:

פויה! אני לא אוהב תות.

אני בכלל לא אוהב תות.
זאת היתה פשוט טעות
כל העניין הזה עם התות.

ומאז הוא אוכל רק מה שאמא שלו מכינה
ולא רוצה דברים שאין ,ושרק לילדים אחרים יש.

הוא אוכל ביצה ולחם וגבינה לבנה
והוא כבר לא בוכה ולא מתנהג כמו טיפש.

יאמי

ומה עם הילדים? )כך אתם בוודאי רוצים לשאול(
הילדים חזרו הביתה ובקשו מהר

לאכול

וכל אמא ואמא שאלה את הילד שלה-

מה אתה רוצה לאכול חמוד?

וכל ילד וילד ענה על השאלה

רק במילה אחת -איזו מילה?... ?

`
   },
   {
    bookId: "4",
    title: "טרופותי",
    author: "ג׳וליה דונלדסון",
    language: "hebrew",
    text: `
פעם היה אריה שאהב רק תות.
לא בשר ולא גבינה ,רק תות פשוט.
לא דיסה ולא קקאו ,רק תות הוא רצה,

תות .לא לחם ,לא ארז ולא
ביצה ,רק תות.

וביער הרחוק ההוא ,שבו הוא היה גר,
לא היה תות.

ישב האריה ובכה ,ובכה ,ואמר:
אני רוצה תות.

באה אמא שלו ,הלביאה ,ואמרה
לו ,תשמע ,חמוד - ,אין תות.
ביער שלנו אין תות.
יש פטל ,שזיפים ,סיגליות ,מרק,
יש אורז ,צ'יפס ,קבב
וארטיק ומיץ ממותק,
אבל תות אין .אין!

תפסיק לבכות ותפסיק להתאונן.

אבל האריה בכה ורצה רק תות,

ואת עיניו נגב ונגב כל הזמן בסמרטוט

ורצה רק תות.
כל הזמן בכה ,וכל הזמן רצה תות ותות.

פעם אחת הלכו ילדים קטנים לטייל ביער ההוא ,ולילדים ההם היה תות.
כי במקום שבו הם גרו ושממנו לטיול יצאו היה תות.

וכשהם יצאו לטיול ,אמא שלהם שמה להם בתיק האוכל תות,
כדי שאם פתאום יהיו רעבים ,יוכלו לאכול תות.

הרבה תות...

ראה האריה את הילדים
והריח תות.

התקרב אליהם ואמר:

תנו לי תות
!

הילדים נבהלו מאד.
הם פחדו מחיות גדולות.
והם גם לא הבינו את שפת האריות.
ולא ידעו שהוא מבקש תות.
הם חשבו שהוא רוצה לטרוף אותם אולי –
אז הם ברחו .ברחו מהר מהר ודי.

וכשהם ברחו ,נפלו להם תיקי האוכל עם התות אכל ה
והאריה הרים את התיקים והתחיל לאכול את התות.

אריה את

ועוד ו

אכל עוד תות
עוד תות

אכל ו

התות

עד שגמר הכל ואמר:

פויה! אני לא אוהב תות.

אני בכלל לא אוהב תות.
זאת היתה פשוט טעות
כל העניין הזה עם התות.

ומאז הוא אוכל רק מה שאמא שלו מכינה
ולא רוצה דברים שאין ,ושרק לילדים אחרים יש.

הוא אוכל ביצה ולחם וגבינה לבנה
והוא כבר לא בוכה ולא מתנהג כמו טיפש.

יאמי

ומה עם הילדים? )כך אתם בוודאי רוצים לשאול(
הילדים חזרו הביתה ובקשו מהר

לאכול

וכל אמא ואמא שאלה את הילד שלה-

מה אתה רוצה לאכול חמוד?

וכל ילד וילד ענה על השאלה

רק במילה אחת -איזו מילה?... ?

`
   }, 
   {
    bookId: "5",
    title: ״איה פלוטו  ״,
    author: "לאה",
    language: "hebrew",
    text: `
`
   }
];
